# ForceOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..ForceOffset Property
IFCExtrusionCreationData Class See Also
---
True to create new local placement with identity transform.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ForceOffset { get; set; }
```

Visual Basic
---
```text
Public Property ForceOffset As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ForceOffset {
	bool get ();
	void set (bool value);
}
```

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace